; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-60)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 - object)
 (:init 
    (arm-empty)
    (clear b8)
    (on b8 b15)
    (on b15 b12)
    (on b12 b17)
    (on b17 b16)
    (on b16 b3)
    (on b3 b1)
    (on-table b1)
    (clear b10)
    (on b10 b2)
    (on b2 b14)
    (on b14 b9)
    (on b9 b11)
    (on b11 b6)
    (on b6 b13)
    (on b13 b18)
    (on b18 b4)
    (on b4 b7)
    (on b7 b5)
    (on-table b5))
 (:goal (and 
(on b11 b17)
))
)

; plan
1. (unstack b8 b15)
   deleted: (on b8 b15) (clear b8) (arm-empty)
   added: (holding b8) (clear b15)
   goals met: 0 of 1
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 1
3. (unstack b10 b2)
   deleted: (on b10 b2) (clear b10) (arm-empty)
   added: (holding b10) (clear b2)
   goals met: 0 of 1
4. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 1
5. (unstack b2 b14)
   deleted: (on b2 b14) (clear b2) (arm-empty)
   added: (holding b2) (clear b14)
   goals met: 0 of 1
6. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 1
7. (unstack b14 b9)
   deleted: (on b14 b9) (clear b14) (arm-empty)
   added: (holding b14) (clear b9)
   goals met: 0 of 1
8. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 1
9. (unstack b15 b12)
   deleted: (on b15 b12) (clear b15) (arm-empty)
   added: (holding b15) (clear b12)
   goals met: 0 of 1
10. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 1
11. (unstack b12 b17)
   deleted: (on b12 b17) (clear b12) (arm-empty)
   added: (holding b12) (clear b17)
   goals met: 0 of 1
12. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 1
13. (unstack b9 b11)
   deleted: (on b9 b11) (clear b9) (arm-empty)
   added: (holding b9) (clear b11)
   goals met: 0 of 1
14. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
15. (unstack b11 b6)
   deleted: (on b11 b6) (clear b11) (arm-empty)
   added: (holding b11) (clear b6)
   goals met: 0 of 1
16. (stack b11 b17)
   deleted: (clear b17) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b17)
   goals met: 1 of 1
